# Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины:
# имена str, ставка int, премия str с указанием процентов вида «10.25%».
# В результате получаем словарь с именем в качестве ключа и суммой
# премии в качестве значения. Сумма рассчитывается как ставка умноженная на процент премии

names = ['Vano', 'Ron', 'Tuk']
salaries = [20_000, 30_000, 10_000]
bonuses = ['10.25%', '12.2%', '11%']


dict_ = {name: salary * float(bonus.strip('%')) / 100 for name, salary, bonus in zip(names, salaries, bonuses)}
print(dict_)
